notes-md/20250118005223-journal_backend_01182025.md

# Table of Contents

1.  [To-Do's](#org6218249)

00:53 Well as always I end up being up late. I just finished the implementation of [Pig Latin Translator](20250117135603-pig_latin_translator.md) I will start to do the planning for [Practice Project - Table Printer](20250118005430-practice_project_table_printer.md) 

**14:00**: I decided to take the saturdays off


<a id="org6218249"></a>

# To-Do's

-   [ ] Do the exercises of the chapter (table printer, zombie dice bots)
    -   [ ] [Practice Project - Table Printer](20250118005430-practice_project_table_printer.md)
    -   [ ] [Practice Project - Zombie Dice Bots](20250118005506-practice_project_zombie_dice_bots.md)
-   [ ] Do the note for strings in python [Python Strings](20250114133247-python_strings.md)

